Repository: AlexandrFirst/ATARK
Catalog: FireSaverSPA/src/i18n/messages.*.xlf
Languages: uk

# ngb.timepicker.HH
source: HH
uk: часи

# ngb.timepicker.hours
source: Hours
uk: часи

# ngb.timepicker.MM
source: MM
uk: мінути

# ngb.timepicker.minutes
source: Minutes
uk: мінути

# ngb.timepicker.SS
source: SS
uk: секунди

# ngb.timepicker.seconds
source: Seconds
uk: секунди

# ngb.toast.close-aria
source: Close
uk: Закрити

source: Responsible users
uk: Відповідальні особи

# loginlabel
source: Login <span class="underline"> </span>
uk: Вхід <span class="underline"> </span>

# mail
source: E-mail
uk: Електрона пошта

# mailEmpty
source: Mail can't be empty
uk: Пошта не може бути пустою

source: Password
uk: Пароль

source: Pass can't be empty
uk: Пароль не може бути пустим

source: Login
uk: Увійти

source: Sign Up <span class="underline"> </span>
uk: Зареєструватися <span class="underline"> </span>

source: Name
uk: Ім'я

# emptyName
source: Name can't be empty
uk: Ім'я не може бути пустим

source: Surname
uk: Прізвище

# emptySurname
source: Surname can't be empty
uk: Прізвище не може бути пустим

# patron
source: Patronymic
uk: По-батькові

# patronEmpty
source: Patronymic can't be empty
uk: По-батькові не може бути пустим

# mailUniq
source: Mail should be unique
uk: Така пошта вже існує

# mailIncorrect
source: Mail has incorrect format
uk: Це не є поштою

# phone
source: Telephone number
uk: Номер телефону

# phonePlaceholder
source: Enter 10 digits or more
uk: +380 XX XXX XX XX or +380-XX-XXX-XX-XX

# phoneEmty
source: Telephone can't be empty
uk: Номер телефону не може бути пустим

# phoneIncorrect
source: Telephone is incorrect
uk: Формат телефону не вірний

# dob
source: Date of birth
uk: Дата народження

# dobEmpty
source: Date of birth should be specified
uk: Дата народження повинна бути вказана

source: Password
uk: Пароль

# passwordEmpty
source: Password can't be empty
uk: Пароль не може бути пустим

# passwordWrongFormat
source: Password must be 8 chars at least, small, big letters, nums and special symbols
uk: Пароль повинен бути від 8 символів, великі, маленькі літери, цифри, спец символи

# passwordConfirm
source: Confirm password
uk: Підтвердження паролю

# passwordConfirmEmpty
source: You should confirm password
uk: Ви повинні підтвердити пароль

# passwordConfirmNonCoincidence
source: Password are not the same
uk: Паролі не збігаються

source: Continue
uk: Зареєструватися

source: this.passwordPattern
uk: ^\\+?3?8?(0[\\s\\.-]\\d{2}[\\s\\.-]\\d{3}[\\s\\.-]\\d{2}[\\s\\.-]\\d{2})$

source: Work is done by Alexandr Lohvinov PZPI-19-3
uk: Робота виконана Олександром Логвіновим ПЗПІ-19-3

# btnSave
source: Save
uk: Зберігти

# btnCancel
source: Cancel
uk: Відмінити

# btnLogout
source: Logout
uk: Вийти

source: Chnage Info
uk: Змінити

source: Delete
uk: Видалити

source: No responsible users yet
uk: Відповідальних користувачей нема

source: Add responsible user
uk: Додати відповідальних користувачей

source: Floors
uk: Поверх

# deletebtn
source: Delete
uk: Видалити

# viewbtn
source: View
uk: Переглянути

# editBtn
source: Change
uk: Змінити

source: No floors added
uk: Поверхів не знайдено

source: Add floor
uk: Додати поверх

source: mail
uk: # щоб шукати за id та без # - за адресою

source: Search
uk: Знайти

source: Id: {{item.id}
uk: Індентифікатор: {{item.id}

# buildingAddress
source: Address: <div>{{item.address}}</div>
uk: Адреса: <div>{{item.address}}</div>

# buildingInfo
source: Info: <div>{{item.info}}</div>
uk: Інформація: <div>{{item.info}}</div>

source: Add
uk: Додати

source: Name:
uk: Ім'я

source: Describtion:
uk: Опис

source: Safety Rules:
uk: Правила безпеки:

source: Level:
uk: Номер поверху:

source: Center map
uk: Вирівняти карту

source: Generate QR-code
uk: Згенерувати QR-код

# loadMapBtn
source: Load map <span *ngIf="uploadingValue > 0">{{uploadingValue}}</span>
uk: Завантажити карту <span *ngIf="uploadingValue > 0">{{uploadingValue}}</span>

# chooseFilePlaceholder
source: Choose file
uk: Обрати файл

source: No points
uk: Точок не знайден

# selectBtn
source: Select
uk: Обрати

source: Add scale point
uk: Додати точку масштабу

source: Route points
uk: Точки маршруту

source: Iots
uk: Розумний пристрій

source: No iots
uk: Розумних пристрієв нема

source: Print qr iot info
uk: qr код для розумного пристрою

source: Add iot
uk: Додати розумний пристрій

source: Rooms
uk: Кімнати

source: Add new room
uk: Нова кімната

source: Add test
uk: Додати тест

source: View test
uk: Переглянути тест

source: Delete test
uk: Видалити тест

source: Loading
uk: Загрузка

source: IoT identifier:
uk: Номер розумного пристрою

source: Enter iot Id
uk: Введыть номер пристрою

# submitBtn
source: Submit
uk: Підтвердити

# cancelBtn
source: Cancel
uk: Відмінити

source: Address
uk: Адреса

source: Fill in this field
uk: Заповніть це поле

source: Info
uk: Інформація

# floorName
source: Name:
uk: Ім'я

source: Enter floor name
uk: Розумний пристрій

source: This field should not be emty
uk: Заповніть це поле

source: Description:
uk: Опис

source: Enter floor describtion
uk: Введіть опис поверха

source: Safety rules:
uk: Правила безпеки

source: Enter safety rules
uk: Введіть правила безпеки

source: Name:
uk: Назва

source: Floor number:
uk: Номер поверха

source: Enter floor level
uk: Введіть номер поверха

source: This floor is already taken
uk: Цей номер поверха зайнят

source: Latitude
uk: Довгота

source: Enter latitude
uk: Введіть довготу

source: This field is required
uk: Заповніть це поле

source: Longtitude
uk: Широта

source: Enter longtitude
uk: Ведіть широту

source: Enter email
uk: Ведіть електрону пошту

source: This user is already responsible
uk: Цей користувач вже відповідальний

source: Try count:
uk: Кількість спроб

source: Enter try count for test
uk: Введіть кількість спроб

source: Question #{{questionIndex + 1}}
uk: Питання #{{questionIndex + 1}}

source: Content:
uk: Вміст:

source: Enter question
uk: Введіть запитання:

source: Answer #{{answerIndex + 1}}
uk: Відповідь #{{answerIndex + 1}}

source: answer text
uk: текст відповіді

source: Answer text
uk: текст відповіді

source: is correct
uk: Правильний

source: Add answer
uk: додати відповідь

source: Add question
uk: додати запитання

source: Building(s)
uk: Будівля(і)

source: Add IoT
uk: Додати пристрій

source: Add responsible user
uk: Додати відповідальну особу

source: Eng
uk: Англ

source: Uk
uk: Укр

source: Account
uk: Аккаунт

source: Scale points
uk: Точки масштабу

source: Update user positions
uk: Обновити позиції користувачей

source: BACKUP DATABSE
uk: Зберігти базу даних

source: RESTORE DATABASE
uk: Оновити базу даних

source: Db is updated
uk: База даних завантажена

source: Db is restored
uk: База даних оновлена
